from collections import OrderedDict

temps = [('2000', -4.4), ('2001', -2.5), ('2002', -4.4), ('2003', -9.5),
         ('2004', -8.2), ('2005', -1.6), ('2006', -5.9), ('2007', -2.4),
         ('2008', -1.7), ('2009', -3.5), ('2010', -12.1), ('2011', -5.8),
         ('2012', -4.9), ('2013', -6.1), ('2014', -6.9), ('2015', -2.7),
         ('2016', -11.2), ('2017', -3.9), ('2018', -2.9), ('2019', -6.5),
         ('2020', 1.5)]

# Напечатайте словарь из температур, отсортированный по уменьшению температуры

ord_temp = OrderedDict(sorted(temps, key = lambda x:x[1], reverse = True))
print(ord_temp)

# from hidden import users
# # Пишите здесь команды, который помогут
# # найти ответы на вопросы
# from collections import deque
# c = deque(users)
# 
# c.popleft()
# print(c)
# c.rotate(-5)
# print(c.pop())
# print(c.count(8))
